In [1]:
import numpy as np
import pandas as pd

In [2]:
dic={
    "names":['ammad','anas','arqam','john wick'],
    "cities":['islamabad',"lahore","swat",'california'],
    'salary':(29000,45000,67000,100000)
}

In [3]:
df=pd.DataFrame(dic)

In [4]:
df

       names      cities  salary
0      ammad   islamabad   29000
1       anas      lahore   45000
2      arqam        swat   67000
3  john wick  california  100000

In [5]:
df.head()

       names      cities  salary
0      ammad   islamabad   29000
1       anas      lahore   45000
2      arqam        swat   67000
3  john wick  california  100000

In [7]:
df.tail(2)

       names      cities  salary
2      arqam        swat   67000
3  john wick  california  100000

In [8]:
df.describe()

              salary
count       4.000000
mean    60250.000000
std     30739.496851
min     29000.000000
25%     41000.000000
50%     56000.000000
75%     75250.000000
max    100000.000000

In [13]:
df.to_csv("practice pandas.csv")

In [12]:
df.to_excel('practice_pandas.xlsx')

In [15]:
pd.read_excel('practice_pandas.xlsx')

   Unnamed: 0      names      cities  salary
0           0      ammad   islamabad   29000
1           1       anas      lahore   45000
2           2      arqam        swat   67000
3           3  john wick  california  100000

In [17]:
df.index=list('abcd')

In [18]:
df

       names      cities  salary
a      ammad   islamabad   29000
b       anas      lahore   45000
c      arqam        swat   67000
d  john wick  california  100000

In [19]:
df.loc['a','names']="shikari"

In [20]:
df

       names      cities  salary
a    shikari   islamabad   29000
b       anas      lahore   45000
c      arqam        swat   67000
d  john wick  california  100000

In [36]:
df.iloc[2,[0,2]]

names     arqam
salary    67000
Name: c, dtype: object

In [29]:
df.loc['b']

names       anas
cities    lahore
salary     45000
Name: b, dtype: object

In [34]:
data=pd.Series(np.arange(10),index=list('abcdefghij'))

In [35]:
data

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
dtype: int32

In [40]:
data.reindex(list('bcdefghija'))

b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
a    0
dtype: int32

In [41]:
data

a    0
b    1
c    2
d    3
e    4
f    5
g    6
h    7
i    8
j    9
dtype: int32